backend/test/load/relatorio_D.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: load_test_D.js
        output: -

     scenarios: (100.00%) 1 scenario, 10000 max VUs, 15m30s max duration (incl. graceful stop):
              * default: 10000 looping VUs for 15m0s (gracefulStop: 30s)


running (00m00.7s), 10000/10000 VUs, 270 complete and 0 interrupted iterations
default   [   0% ] 10000 VUs  00m00.7s/15m0s

running (00m01.7s), 10000/10000 VUs, 4317 complete and 0 interrupted iterations
default   [   0% ] 10000 VUs  00m01.7s/15m0s

running (00m02.7s), 10000/10000 VUs, 7990 complete and 0 interrupted iterations
default   [   0% ] 10000 VUs  00m02.7s/15m0s

running (00m03.7s), 10000/10000 VUs, 11747 complete and 0 interrupted iterations
default   [   0% ] 10000 VUs  00m03.7s/15m0s

running (00m04.7s), 10000/10000 VUs, 15379 complete and 0 interrupted iterations
default   [   1% ] 10000 VUs  00m04.7s/15m0s

running (00m05.7s), 10000/10000 VUs, 19288 complete and 0 interrupted iterations
default   [   1% ] 10000 VUs  00m05.7s/15m0s

running (00m06.9s), 10000/10000 VUs, 23808 complete and 0 interrupted iterations
default   [   1% ] 10000 VUs  00m06.9s/15m0s

running (00m07.7s), 10000/10000 VUs, 27890 complete and 0 interrupted iterations
default   [   1% ] 10000 VUs  00m07.7s/15m0s

running (00m08.7s), 10000/10000 VUs, 31699 complete and 0 interrupted iterations
default   [   1% ] 10000 VUs  00m08.7s/15m0s

running (00m09.8s), 10000/10000 VUs, 36408 complete and 0 interrupted iterations
default   [   1% ] 10000 VUs  00m09.8s/15m0s

running (00m10.7s), 10000/10000 VUs, 40919 complete and 0 interrupted iterations
default   [   1% ] 10000 VUs  00m10.7s/15m0s

running (00m11.7s), 10000/10000 VUs, 44740 complete and 0 interrupted iterations
default   [   1% ] 10000 VUs  00m11.7s/15m0s

running (00m12.7s), 10000/10000 VUs, 48382 complete and 0 interrupted iterations
default   [   1% ] 10000 VUs  00m12.7s/15m0s

running (00m13.7s), 10000/10000 VUs, 52416 complete and 0 interrupted iterations
default   [   2% ] 10000 VUs  00m13.7s/15m0s

running (00m14.7s), 10000/10000 VUs, 56792 complete and 0 interrupted iterations
default   [   2% ] 10000 VUs  00m14.7s/15m0s

running (00m15.7s), 10000/10000 VUs, 60884 complete and 0 interrupted iterations
default   [   2% ] 10000 VUs  00m15.7s/15m0s

running (00m16.7s), 10000/10000 VUs, 64589 complete and 0 interrupted iterations
default   [   2% ] 10000 VUs  00m16.7s/15m0s

running (00m17.7s), 02581/10000 VUs, 67116 complete and 304478 interrupted iterations
default   [   2% ] 10000 VUs  00m17.7s/15m0s

     █ Upload Research

     █ Get Research Status

     █ Delete Research

     data_received..............: 5.1 kB  284 B/s
     data_sent..................: 43 MB   2.4 MB/s
     group_duration.............: avg=2.14s    min=347.29µs med=1.2s     max=17.32s   p(90)=4.13s p(95)=7.28s
     http_req_blocked...........: avg=924.7ms  min=0s       med=539.88ms max=13.74s   p(90)=1.49s p(95)=2.42s
     http_req_connecting........: avg=924.62ms min=0s       med=539.83ms max=13.74s   p(90)=1.49s p(95)=2.42s
     http_req_duration..........: avg=1.22s    min=0s       med=573.01ms max=16.05s   p(90)=2.46s p(95)=4.8s 
     http_req_failed............: 100.00% ✓ 67143       ✗ 0      
     http_req_receiving.........: avg=4ns      min=0s       med=0s       max=51µs     p(90)=0s    p(95)=0s   
     http_req_sending...........: avg=152.81µs min=0s       med=19µs     max=173.01ms p(90)=270µs p(95)=492µs
     http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(90)=0s    p(95)=0s   
     http_req_waiting...........: avg=1.22s    min=0s       med=572.93ms max=16.05s   p(90)=2.46s p(95)=4.8s 
     http_reqs..................: 67143   3775.48762/s
     iteration_duration.........: avg=2.14s    min=457.79µs med=1.2s     max=17.32s   p(90)=4.13s p(95)=7.26s
     iterations.................: 67127   3774.587931/s
     vus........................: 10000   min=10000     max=10000
     vus_max....................: 10000   min=10000     max=10000


running (00m17.8s), 00000/10000 VUs, 67116 complete and 307055 interrupted iterations
default ✗ [   2% ] 10000 VUs  00m17.8s/15m0s